
## 🏗️ Terraform Plan Results

### Plan Summary
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.database.aws_cloudwatch_log_group.database will be created
  + resource "aws_cloudwatch_log_group" "database" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/rds/instance/production-n8n-database/postgresql"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-n8n-database-logs"
          + "Owner"       = "superinsight"
          + "Project"     = "n8n-hipaa-compliance"
        }
      + tags_all          = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-n8n-database-logs"
          + "Owner"       = "superinsight"
          + "Project"     = "n8n-hipaa-compliance"
        }
    }

  # module.database.aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 50
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "n8n_production"
      + db_subnet_group_name                  = "production-n8n-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "15.7"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = "production-n8n-db-final-snapshot"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "production-n8n-database"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.medium"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "sun:04:00-sun:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "production-n8n-db-params"
      + password                              = (sensitive value)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                  
... (truncated)
```

### 💰 Estimated Monthly Cost
- **ECS Fargate**: ~$120-200 (2 tasks, 2vCPU, 4GB each)
- **RDS PostgreSQL**: ~$60-90 (db.t3.medium)
- **Application Load Balancer**: ~$20
- **Storage & Monitoring**: ~$40-100
- **Total Estimated**: ~$240-410/month

---
*Generated by GitHub Actions*
